       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM-FILE.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 PROGRAM-TABLE.
               05 PROGRAM-TABLE-ENTRY OCCURS 20 TIMES INDEXED T-ENTRY.
                   10 PROGRAM-TABLE-CODE PIC X(6).
                   10 PROGRAM-TABLE-NAME PIC X(20).
