       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPYEG1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY "./DATADIV.txt".

       PROCEDURE DIVISION.
           MOVE "JASON" TO STUDENT-NAME.
           DISPLAY "HELLO " STUDENT-NAME.
       STOP RUN.
